#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.azuread_client_config.current: Reading...
data.azuread_client_config.current: Read complete after 0s [id=4d02d6f1-0a23-46e7-9e4b-67fe15ccc9d2-d8d61e78-2b84-48fa-8ab3-818bf9b582cc-a41c4bdc-c09b-4493-b4c0-11971219a839]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=2022-09-20 21:52:48.647720502 +0000 UTC]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.azuread_service_principal.data-ACR-access-app-service-principal will be read during apply
  # (config refers to values not yet known)
 <= data "azuread_service_principal" "data-ACR-access-app-service-principal" {
      + account_enabled               = (known after apply)
      + alternative_names             = (known after apply)
      + app_role_assignment_required  = (known after apply)
      + app_role_ids                  = (known after apply)
      + app_roles                     = (known after apply)
      + application_id                = (known after apply)
      + application_tenant_id         = (known after apply)
      + description                   = (known after apply)
      + display_name                  = (known after apply)
      + features                      = (known after apply)
      + homepage_url                  = (known after apply)
      + id                            = (known after apply)
      + login_url                     = (known after apply)
      + logout_url                    = (known after apply)
      + notes                         = (known after apply)
      + notification_email_addresses  = (known after apply)
      + oauth2_permission_scope_ids   = (known after apply)
      + oauth2_permission_scopes      = (known after apply)
      + object_id                     = (known after apply)
      + preferred_single_sign_on_mode = (known after apply)
      + redirect_uris                 = (known after apply)
      + saml_metadata_url             = (known after apply)
      + saml_single_sign_on           = (known after apply)
      + service_principal_names       = (known after apply)
      + sign_in_audience              = (known after apply)
      + tags                          = (known after apply)
      + type                          = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # azuread_application.ACR-access-app will be created
  + resource "azuread_application" "ACR-access-app" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "TerraformAcrAccess"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + template_id                 = (known after apply)
    }

  # azuread_application_password.ACR-access-app-password will be created
  + resource "azuread_application_password" "ACR-access-app-password" {
      + application_object_id = (known after apply)
      + display_name          = "GHActionsAcrAccessSecret"
      + end_date              = "2022-09-01T01:02:03Z"
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # azurerm_container_registry.acr-prod will be created
  + resource "azurerm_container_registry" "acr-prod" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "northeurope"
      + login_server                  = (known after apply)
      + name                          = "acrprojectfprod001"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-projectf-prod-002"
      + retention_policy              = (known after apply)
      + sku                           = "Standard"
      + tags                          = {
          + "CreatedBy" = "a41c4bdc-c09b-4493-b4c0-11971219a839"
        }
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # azurerm_resource_group.rg-projectf-prod-001 will be created
  + resource "azurerm_resource_group" "rg-projectf-prod-001" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "rg-projectf-prod-001"
    }

  # azurerm_resource_group.rg-projectf-prod-002 will be created
  + resource "azurerm_resource_group" "rg-projectf-prod-002" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "rg-projectf-prod-002"
      + tags     = {
          + "CreatedBy" = "a41c4bdc-c09b-4493-b4c0-11971219a839"
        }
    }

  # azurerm_role_assignment.acr-role-assignment-prod will be created
  + resource "azurerm_role_assignment" "acr-role-assignment-prod" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPush"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # github_actions_secret.github-acr-access-app-id will be created
  + resource "github_actions_secret" "github-acr-access-app-id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "Project-F"
      + secret_name     = "SP_APPID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.github-acr-access-app-password will be created
  + resource "github_actions_secret" "github-acr-access-app-password" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "Project-F"
      + secret_name     = "SP_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.github-docker-server-name will be created
  + resource "github_actions_secret" "github-docker-server-name" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "Project-F"
      + secret_name     = "DOCKER_SERVER"
      + updated_at      = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @Retoxx-dev, Action: `pull_request`*